/** 
 * File:   Lib_A_RGBF_ring_buffer.h
 * Author: Isaev
 *
 * Created on 8 октября 2017 г., 19:45
 */

#ifndef LIB_A_RGBF_RING_BUFFER_H
#define	LIB_A_RGBF_RING_BUFFER_H

//******************************************************************************
//  Секция include (подключаем заголовочные файлы используемых модулей)
//------------------------------------------------------------------------------
//  Стандартные библиотеки языка С
#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
//  Библиотеки для работы с периферией микроконтроллера
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
//  Внешние модули
//------------------------------------------------------------------------------
//******************************************************************************


//******************************************************************************
//  Секция определения констант
//******************************************************************************


//******************************************************************************
//  Секция определения типов

typedef struct {
    uint8_t * const startBuff; //   Указатель на адрес начала массива кольцевого буфера;
    uint8_t * const endBuff; //     Указательн на адрес конца массива кольцевого буфера;
    uint8_t *pWrite; //             Указатель на место в памяти куда будут 
    //                              записываться данные;
    uint8_t *pRead; //              Указатель на место в памяти откуда будут 
    //                              считываться данные;
} RGBF_ring_buf_s; /*  Структура, содержащая указатели для работы с кольцевым 
                     *  буфером;
                     * 
                     *  Пример инициализации массива кольцевого буфера и 
                     *  структуры указателей:
                     *  //------------------------------------------------------
                     *  #define UART1_RING_BUFF_SIZE                    64
                     *  uint8_t uart1RingBuff[UART1_RING_BUFF_SIZE];
                     *  RGBF_ring_buff_t uart1RingBuffPointers = {uart1RingBuff,
                     *  &uart1RingBuff[UART1_RING_BUFF_SIZE - 1],
                     *  uart1RingBuff, uart1RingBuff};
                     *  //------------------------------------------------------
                     */
//******************************************************************************


//******************************************************************************
//  Секция определения глобальных переменных
//******************************************************************************


//******************************************************************************
//  Секция прототипов глобальных функций
extern void RGBF_RingBuffInArr(RGBF_ring_buf_s *ringBuff,
        uint8_t *pData,
        size_t cnt);
extern void RGBF_RingBuff_In(RGBF_ring_buf_s *ringBuff,
        void *pValue,
        size_t bytesNumb);
extern void RGBF_RingBuff_Out(RGBF_ring_buf_s *ringBuff,
        void *pArr,
        size_t lenght);
extern size_t RGBF_RingBuffCheckDataCnt(RGBF_ring_buf_s *ringBuff);
extern void RGBF_ResetRingBuff(RGBF_ring_buf_s *ringBuff);
//******************************************************************************


//******************************************************************************
//  Секция определения макросов
//******************************************************************************

#endif	/* LIB_A_RGBF_RING_BUFFER_H */

////////////////////////////////////////////////////////////////////////////////
// END OF FILE
////////////////////////////////////////////////////////////////////////////////
